Revit 2027 API
Form.TopOffset Property
Retrieve/set the top offset of the form object. It is only valid for locked form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopOffset { get; set; }
Public Property TopOffset As Double
	Get
	Set
public:
property double TopOffset {
	double get ();
	void set (double value);
}
member TopOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
InvalidOperationException | Thrown when this is not a locked form.
ArgumentException | Thrown when the value is invalid.
ApplicationException | Thrown when it fail to get/set TopOffset.
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace